<template>
    <div>
        <div class="anchor" :style="anchorStyle">
            <a href="#archor0" class="link">滕王阁序</a>
            <a href="#archor1" class="link">岳阳楼记</a>
            <a href="#archor2" class="link">醉翁亭记</a>
        </div>
        <article :class="{main: true, [`main${i}`]: true}" v-for="(item, i) in article" :id="`archor${i}`">
            <h3 class="title">{{item.title}}</h3>
            <p class="item" v-for="detail in item.main">{{detail}}</p>
        </article>
    </div>
</template>
<script>
    export default {
        data() {
            return {
                scrollTop: 0,
                article: [
                    {
                        title: '滕王阁序-----王勃',
                        main: [
                            '豫章故郡，洪都新府。星分翼轸，地接衡庐。襟三江而带五湖，控蛮荆而引瓯越。物华天宝，龙光射牛斗之墟；人杰地灵，徐孺下陈蕃之榻。雄州雾列，俊采星驰。台隍枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨戟遥临；宇文新州之懿范，襜帷暂驻。十旬休假，胜友如云；千里逢迎，高朋满座。腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。家君作宰，路出名区；童子何知，躬逢胜饯。',
                            '时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。俨骖騑于上路，访风景于崇阿。临帝子之长洲，得仙人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。',
                            '披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；舸舰迷津，青雀黄龙之舳。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。渔舟唱晚，响穷彭蠡之滨，雁阵惊寒，声断衡阳之浦。',
                            '遥襟甫畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。四美具，二难并。穷睇眄于中天，极娱游于暇日。天高地迥，觉宇宙之无穷；兴尽悲来，识盈虚之有数。望长安于日下，目吴会于云间。地势极而南溟深，天柱高而北辰远。关山难越，谁悲失路之人；萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？',
                            '嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！',
                            '勃，三尺微命，一介书生。无路请缨，等终军之弱冠；有怀投笔，慕宗悫之长风。舍簪笏于百龄，奉晨昏于万里。非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？',
                            '呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。敢竭鄙怀，恭疏短引；一言均赋，四韵俱成。请洒潘江，各倾陆海云尔：',
                            '滕王高阁临江渚，佩玉鸣鸾罢歌舞。',
                            '画栋朝飞南浦云，珠帘暮卷西山雨。',
                            '闲云潭影日悠悠，物换星移几度秋。',
                            '阁中帝子今何在？槛外长江空自流。'
                        ]
                    }, 
                    {
                        title: '岳阳楼记-----范仲淹',
                        main: [
                            '庆历四年春，滕子京谪守巴陵郡。越明年，政通人和，百废具兴。乃重修岳阳楼，增其旧制，刻唐贤今人诗赋于其上。属予作文以记之。',
                            '予观夫巴陵胜状，在洞庭一湖。衔远山，吞长江，浩浩汤汤，横无际涯；朝晖夕阴，气象万千。此则岳阳楼之大观也，前人之述备矣。然则北通巫峡，南极潇湘，迁客骚人，多会于此，览物之情，得无异乎?',
                            '若夫淫雨霏霏，连月不开，阴风怒号，浊浪排空；日星隐耀，山岳潜形；商旅不行，樯倾楫摧；薄暮冥冥，虎啸猿啼。登斯楼也，则有去国怀乡，忧谗畏讥，满目萧然，感极而悲者矣。',
                            '至若春和景明，波澜不惊，上下天光，一碧万顷；沙鸥翔集，锦鳞游泳；岸芷汀兰，郁郁青青。而或长烟一空，皓月千里，浮光跃金，静影沉璧，渔歌互答，此乐何极！登斯楼也，则有心旷神怡，宠辱偕忘，把酒临风，其喜洋洋者矣。',
                            '嗟夫！予尝求古仁人之心，或异二者之为，何哉？不以物喜，不以己悲；居庙堂之高则忧其民；处江湖之远则忧其君。是进亦忧，退亦忧。然则何时而乐耶？其必曰：“先天下之忧而忧，后天下之乐而乐”乎。噫！微斯人，吾谁与归？',
                            '时六年九月十五日。'
                        ]
                    }, 
                    {
                        title: '醉翁亭记-----欧阳修',
                        main: [
                            '环滁皆山也。其西南诸峰，林壑尤美，望之蔚然而深秀者，琅琊也。山行六七里，渐闻水声潺潺而泻出于两峰之间者，酿泉也。峰回路转，有亭翼然临于泉上者，醉翁亭也。作亭者谁？山之僧智仙也。名之者谁？太守自谓也。太守与客来饮于此，饮少辄醉，而年又最高，故自号曰醉翁也。醉翁之意不在酒，在乎山水之间也。山水之乐，得之心而寓之酒也。',
                            '若夫日出而林霏开，云归而岩穴暝，晦明变化者，山间之朝暮也。野芳发而幽香，佳木秀而繁阴，风霜高洁，水落而石出者，山间之四时也。朝而往，暮而归，四时之景不同，而乐亦无穷也',
                            '至于负者歌于途，行者休于树，前者呼，后者应，伛偻提携，往来而不绝者，滁人游也。临溪而渔，溪深而鱼肥。酿泉为酒，泉香而酒洌；山肴野蔌，杂然而前陈者，太守宴也。宴酣之乐，非丝非竹，射者中，弈者胜，觥筹交错，起坐而喧哗者，众宾欢也。苍颜白发，颓然乎其间者，太守醉也。',
                            '已而夕阳在山，人影散乱，太守归而宾客从也。树林阴翳，鸣声上下，游人去而禽鸟乐也。然而禽鸟知山林之乐，而不知人之乐；人知从太守游而乐，而不知太守之乐其乐也。醉能同其乐，醒能述以文者，太守也。太守谓谁？庐陵欧阳修也。'
                        ]
                    }
                ]
            }
        },
        computed: {
            anchorStyle() {
                let top = `calc(50vh - 64px + ${this.scrollTop}px)`
                return {
                    marginTop: top
                }
            }
        },
        created() {
            let _this = this
            window.onscroll = function() {
                _this.scrollTop = document.documentElement.scrollTop || document.body.scrollTop
            }
        }
    }
</script>
<style>
    .main {
        padding: 32px 16px;
    }
    .main0 {
        background: #fef4f4;
    }
    .main1 {
        background: #fdeff2;
    }
    .main2 {
        background: #e4d2d8;
    }

    .title {
        margin-bottom: 24px;
        font-size: 18px;
        text-align: center;
    }
   .item {
        margin-bottom: 16px;
        line-height: 2;
        font-size: 14px;
        text-indent: 32px;
   }

   .anchor {
        position: relative;
        float: right;
        padding: 16px;
        border: 1px solid #ee827c;
        border-right: none;
        shape-outside: border-box;
        border-radius: 4px 0 0 4px;
        transition: all 0.1s;
   }

   .link {
        display: block;
        color: #f0908d;
        line-height: 2;
        text-decoration: none;
   }
</style>